-- phpMyAdmin SQL Dump
-- version 4.7.6
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: 2018-06-28 11:17:06
-- 服务器版本： 10.1.29-MariaDB
-- PHP Version: 7.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `ConvenientStore`
--
CREATE DATABASE IF NOT EXISTS `ConvenientStore` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `ConvenientStore`;

-- --------------------------------------------------------

--
-- 表的结构 `FamilyMart`
--

CREATE TABLE `FamilyMart` (
  `Fno` int(6) NOT NULL,
  `Fname` varchar(5) DEFAULT NULL,
  `Flocation` varchar(30) DEFAULT NULL,
  `Fphone` char(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `FamilyMart`
--

INSERT INTO `FamilyMart` (`Fno`, `Fname`, `Flocation`, `Fphone`) VALUES
(1, '', '1222', ''),
(4277, '建鑫店', '台北市信義區松壽路24號', '02-7723044'),
(10130, '中影店', '台北市士林區至善路二段268號一樓', '02-7709615'),
(10289, '高雄民益店', '高雄市小港區二苓路246號', '07-9744195'),
(10368, '永孝店', '台北市信義區松信路145號', '02-7723038'),
(10980, '北鑫店', '台北市南港區中坡南路15號', '02-7746760'),
(11616, '仁慈店', '台北市大安區仁愛路四段48巷6號', '02-7709651'),
(11889, '歸仁大順店', '台南市歸仁區大順街170號一樓', '06-7035463'),
(12127, '宏大店', '台北市松山區敦化路155巷3號1樓', '02-7723037'),
(12363, '工業三店', '台北市南港區三重路66之2號1樓', '02-7723060'),
(12602, '松興店', '台北市信義區松山路107號', '02-7723041'),
(12910, '成功店', '台北市大安區和平東路二段311巷32號', '02-7709652'),
(12911, '光新店', '台北市大安區光復南路418號', '02-7709651'),
(12953, '永吉二店', '台北市信義區永吉路223號', '02-7723037'),
(13370, '士林店', '台北市士林區中山北路五段697號', '02-7709612'),
(13409, '大安店', '台北市大安區大安路一段20號', '02-7709651'),
(13548, '大北店', '台北市士林區文林路320號', '02-7709613'),
(13549, '辛亥店', '台北市大安區辛亥路二段171巷3號', '02-7709652'),
(13794, '京民店', '台北市松山區三民路6號+B1', '02-7717954'),
(13885, '台南新樓店', '台南市東區東門路一段57號1樓', '06-7030129'),
(13938, '中崙店', '台北市松山區八德路三段74巷43號', '02-7723036'),
(14091, '新大吉店', '台北市松山區吉祥路19號', '02-7730281'),
(14206, '通和店', '台北市大安區通安街77號', '02-7709654'),
(14223, '高雄沿海店', '高雄市小港區沿海一路397之5號', '07-9744229'),
(14261, '慶城店', '台北市松山區慶城街8號', '02-7723042'),
(14275, '台南河美店', '台南市安平區安平路428號', '06-7030785'),
(14542, '新東店', '台北市松山區新東街14號', '02-7723038'),
(14576, '港成店', '台北市南港區南港路三段2號', '02-7730064'),
(14649, '高雄旭日店', '高雄市小港區中安路926號', '07-9769372'),
(15059, '大南店', '台北市士林區大南路52號', '02-7709612'),
(15064, '协和店', '台北市信義區中坡南路38號1F', '02-7723036'),
(15080, '高雄醫大店', '高雄市三民區十全一路100號', '07-9769762'),
(15117, '高雄明哲店', '高雄市三民區明賢路38號一樓及地下室', '07-9769980'),
(15258, '高雄安康店', '高雄市三民區九如一路889 -4 號', '07-9744391'),
(15302, '林森路店', '台南市東區林森路二段188號', '06-7035471'),
(15402, '歸仁長榮店', '台南市歸仁區長大路1號第一宿舍一樓', '06-7030175'),
(15433, '盛興店', '台北市信義區吳興街334號', '02-7730107'),
(15446, '新文化店', '台南市歸仁區民權北路147號', '06-7030603'),
(15522, '高雄機場店', '高雄市小港區中山四路2號一樓部分', '07-9769757'),
(15587, '微風店', '台北市松山區市民大道四段51號1樓', '02-7723041'),
(15861, '安賢店', '台北市大安區四維路170巷4號', '02-7713632'),
(15906, '大理店', '台北市松山區光復北路11巷50號1樓', '02-7723037'),
(15953, '大道店', '台北市信義區大道路79號1樓', '02-7723042'),
(15966, '台南一中店', '台南市東區民族路一段1號', '06-7035468'),
(15980, '台南文平店', '台南市安平區文平路405、407號', '06-7035480'),
(16260, '北醫店', '台北市信義區吳興街263號', '02-7723037'),
(16261, '松站店', '台北市信義區松隆路329巷8號壹樓', '02-7723049'),
(16322, '安居店', '台北市大安區安居街76號', '02-7709652'),
(16375, '芝玉店', '台北市士林區士東路266巷5弄16號', '02-7709612'),
(16464, '研究院店', '台北市南港區研究院路二段70巷1號', '02-7729290'),
(16465, '松永店', '台北市信義區松德路157號', '02-7746306'),
(16513, '歸仁文仁店', '台南市歸仁區民族北街85號一樓', '06-7035465'),
(16542, '松民店', '台北市松山區民生東路五段159號', '02-7746315'),
(16801, '三富店', '台北市松山區五常街364號1樓', '02-7723047'),
(16840, '向陽店', '台北市南港區重陽路16號一樓', '02-7723060'),
(16909, '和信店', '台北市大安區安和路一段104號', '02-2755639'),
(17048, '高雄力行店', '高雄市三民區九如二路138號', '07-9769782'),
(17121, '師大店', '台北市大安區師大路79號', '02-7709654');

-- --------------------------------------------------------

--
-- 表的结构 `Manager`
--

CREATE TABLE `Manager` (
  `Mname` varchar(5) NOT NULL,
  `Mno` char(4) NOT NULL,
  `Mpassword` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `Manager`
--

INSERT INTO `Manager` (`Mname`, `Mno`, `Mpassword`) VALUES
('俞之潔', 'E001', '123456'),
('江翊寧', 'E002', '123456');

-- --------------------------------------------------------

--
-- 表的结构 `SevenEleven`
--

CREATE TABLE `SevenEleven` (
  `Sno` int(6) NOT NULL,
  `Sname` varchar(5) DEFAULT NULL,
  `Slocation` varchar(30) NOT NULL,
  `Sphone` char(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `SevenEleven`
--

INSERT INTO `SevenEleven` (`Sno`, `Sname`, `Slocation`, `Sphone`) VALUES
(111153, '大埕', '台南市七股區大埕里272號1樓', '06-7873054'),
(113126, '山上', '台南市山上區南洲337-3號', '06-5784711'),
(115959, '昇隆', '台北市大安區敦化南路2段238號', '02-2732845'),
(122212, '崇德', '台北市信義區崇德街104號106號1樓', '02-8732427'),
(127561, '大社', '高雄市大社區翠屏里三民路304號', '07-3527294'),
(128036, '新工農', '台北市信義區忠孝東路5段236巷6-3號8號1樓', '02-2345663'),
(129372, '天美', '台北市士林區天母東路8巷98號', '02-2876270'),
(131401, '士正', '台北市士林區中正路301號1樓', '02-2881335'),
(131984, '三樂', '台北市士林區劍潭路21號1樓', '02-2883292'),
(132998, '胡適', '台北市南港區研究院路二段94號96號98巷1號', '02-2651220'),
(138066, '文五', '台南市安平區國平里文平路217號', '06-2988638'),
(138583, '市大', '台北市松山區市民大道路四段105號', '02-8771048'),
(140210, '中坡', '台北市南港區中坡南路47號1樓', '02-2786454'),
(140519, '安平', '台南市安平區安平路99號', '06-2226940'),
(142319, '鼓山', '高雄市鼓山區鼓山二路125之1號127號127之1號1樓', '07-5215439'),
(143840, '大潭', '台南市歸仁區大潭里長榮路一段320巷11號', '06-2783243'),
(143921, '智由', '高雄市三民區德智里熱河一街190號192號', '07-3137226'),
(144795, '中貿', '台北市南港區經貿二路186號2樓', '02-2783983'),
(144980, '自由', '台南市東區和平里自由路二段37號', '06-2908094'),
(148100, '向揚', '台北市南港區向陽路166號1樓', '02-2783106'),
(149136, '本元', '高雄市三民區建工路317號319號', '07-3810634'),
(149697, '三興', '台北市信義區吳興街156巷2弄2號4號1樓', '02-2733502'),
(153294, '台金', '台北市信義區市府路45號B1之53', '02-8101819'),
(153319, '大台', '台北市大安區羅斯福路3段283巷14弄16號1樓', '02-2363622'),
(154046, '大阪', '高雄市三民區建國三路28號30號1樓', '07-2862296'),
(158897, '美珍', '高雄市鼓山區明誠四路23號', '07-5502901'),
(158923, '北體', '台北市松山區北寧路66號', '02-2577111'),
(161343, '文藻', '高雄市三民區民族一路900號', '07-3107895'),
(161376, '捷忠', '台北市信義區忠孝東路5段617號', '02-8785602'),
(164951, '力大', '台南市東區生產路299號', '06-2683042'),
(165253, '歸仁', '台南市歸仁區中山路2段60號', '06-2390164'),
(166865, '港環球', '台北市南港區忠孝東路七段371號B2', '02-2783978'),
(167651, '一零一', '台北市信義區信義路五段7號35樓', '02-2722234'),
(170266, '明榮', '高雄市鼓山區明誠里明華路204號', '07-5542062'),
(170370, '好事達', '高雄市大社區保社里旗楠路71號', '07-3538846'),
(170587, '天北', '台北市士林區天母里天母西路39-1號1樓', '02-2876065'),
(170657, '復安', '台北市松山區民生東路三段130巷2之1號1樓', '02-2712792'),
(171421, '統威', '台北市松山區東興路13之1號', '02-2748176'),
(173988, '延壽', '台北市松山區延壽街422號', '02-2762288'),
(174028, '三玉', '台北市士林區天母東路88之1號1樓', '02-2874458'),
(175032, '中廣', '台北市大安區仁愛路三段25-1號27號', '02-2752675'),
(184586, '大敦', '台北市大安區敦化南路二段63巷7號1樓', '02-2704563'),
(184645, '小東', '台南市東區小東路256號', '06-2341994'),
(184748, '松民', '台北市松山區三民路10號', '02-2748032'),
(190064, '京復', '台北市松山區光復北路11巷44號', '02-2742564'),
(190330, '必成', '台北市信義區基隆路1段178號180號1樓', '02-2764091'),
(844893, '民強', '高雄市鼓山區九如四路706號708號710號', '07-5214862'),
(854557, '一心', '台南市東區中華東路一段24號', '06-2084962'),
(854580, '留公', '台北市信義區福德街249號', '02-2759144'),
(880419, '古都', '台南市東區仁和路133號', '06-2894755'),
(881489, '府城', '台南市安平區永華路二段532號', '06-2973245'),
(894359, '辛亥', '台北市大安區辛亥路2段57號', '02-2363029'),
(903439, '七股', '台南市七股區七股里14鄰154-1號', '06-7872182'),
(916527, '清愿', '台北市松山區八德路2段439號', '02-2772927'),
(921633, '大信', '台北市大安區信義路三段33號', '02-2709647'),
(935768, '內惟', '高雄市鼓山區九如四路1432號1434號', '07-5879203'),
(946458, '大義', '高雄市三民區大昌二路123號123-1號', '07-3870742'),
(946883, '北科大', '台北市大安區忠孝東路3段1號(台北科技大學大川堂)', '02-8773314'),
(950480, '北岡山', '高雄市岡山區灣裡里岡山北路150號', '07-6224840'),
(953995, '高鐵南站', '台南市歸仁區沙崙里歸仁大道100號', '06-6005665'),
(954529, '長榮大', '台南市歸仁區大潭里長榮路一段396號(長榮大學內第4宿舍B1', '06-2785977'),
(961055, '南京', '台北市松山區南京東路3段303巷5號', '02-2546653'),
(961295, '民有', '台北市松山區民權東路3段108號', '02-2715429'),
(961974, '革新', '台北市信義區永吉路32號', '02-2768891'),
(962601, '花市', '台北市大安區建國南路一段274號', '02-2755254'),
(962771, '吉吉好', '台南市東區崇德路670號', '06-2906462'),
(972435, '育樂', '台南市東區大學里勝利路116號', '06-2096748'),
(975962, '仁安', '台北市大安區仁愛路四段27巷1號', '02-8773274'),
(977359, '仕吉', '台北市大安區忠孝東路4段223巷42號', '02-8773090'),
(980757, '高美', '高雄市鼓山區龍水里美術東二路181號', '07-5224427'),
(981015, '新甲仙', '高雄市甲仙區西安里文化路56號58號1樓', '07-6754420'),
(990237, '農神', '高雄市鼓山區龍子里神農路183號185號1樓', '07-5228389'),
(990721, '市捷', '台北市信義區忠孝東路五段6號1樓', '02-2345331'),
(991573, '觀音', '高雄市大社區大新路111號金龍路316號318號', '07-3521272'),
(993535, '沙崙站', '台南市歸仁區沙崙里歸仁大道100號二樓', '06-6015549');

-- --------------------------------------------------------

--
-- 表的结构 `Special`
--

CREATE TABLE `Special` (
  `name` varchar(5) NOT NULL,
  `address` varchar(30) NOT NULL,
  `lat` float(10,6) NOT NULL,
  `lng` float(10,6) NOT NULL,
  `type` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `Special`
--

INSERT INTO `Special` (`name`, `address`, `lat`, `lng`, `type`) VALUES
('全台最北', '新北市石門區中山路78號', 25.291882, 121.567657, 'seven'),
('全台最南', '屏東縣恆春鎮船帆路720號1樓', 21.934118, 120.823395, 'seven'),
('全台最西', '台南市安南區安中路六段599號601號', 23.062286, 120.129730, 'seven'),
('全台最東', '新北市貢寮區福隆街8號8-1號', 25.016134, 121.944954, 'seven'),
('博物馆', '台中市西區博館路117號', 24.156498, 120.665207, 'family'),
('全台最霹靂', '新北市三重區中正北路18之2號之3號之4號1樓', 25.063211, 121.488380, 'seven'),
('澎湖门店', '澎湖縣白沙鄉赤崁村20鄰大赤崁351號1樓', 23.667522, 119.600616, 'seven'),
('台东大同', '台東縣成功鎮三民里大同路70號', 22.753147, 121.153313, 'family'),
('高雄醫學店', '高雄市三民區十全一路100號', 22.646284, 120.309273, 'family'),
('全台最大', '台北市信義區松仁路91-1號1樓', 25.036844, 121.568657, 'seven'),
('花莲全家', '花蓮縣花蓮市中山路708號1樓', 23.986650, 121.601593, 'family'),
('民宿', '宜蘭縣五結鄉傳藝路1段369號1樓', 24.681581, 121.806564, 'seven'),
('九份', '新北市瑞芳區基山街3號', 25.110250, 121.845268, 'family'),
('金门', '金門縣金沙鎮汶沙里國中路2號', 24.488541, 118.413651, 'seven'),
('澎湖全家', '澎湖縣白沙鄉吉貝183 -9 號', 23.574339, 119.578148, 'family');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `FamilyMart`
--
ALTER TABLE `FamilyMart`
  ADD PRIMARY KEY (`Fno`);

--
-- Indexes for table `Manager`
--
ALTER TABLE `Manager`
  ADD PRIMARY KEY (`Mno`);

--
-- Indexes for table `SevenEleven`
--
ALTER TABLE `SevenEleven`
  ADD PRIMARY KEY (`Sno`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
